// Rashifol.tk all rights reserved
// Author : Sandip Sadhukhan

// All Datas are here
// List of all bengali weekdays
const dayToBanglaDayList = ['রবিবার', 'সোমবার', 'মঙ্গলবার', 'বুধবার', 'বৃহস্পতিবার', 'শুক্রবার', 'শনিবার'];

// Bengali numbers from english string
const englishToBangaliNumber = (str) => {
    BengaliNumbersDict = {
        '1': '১',
        '2': '২',
        '3': '৩',
        '4': '৪',
        '5': '৫',
        '6': '৬',
        '7': '৭',
        '8': '৮',
        '9': '৯',
        '0': '০'
    }
    output = ''
    for(let i = 0; i<str.length; i++){
        let ch = str.charAt(i);
        if(ch>="0" && ch<="9"){
            output += BengaliNumbersDict[ch];
        }else{
            output += ch;
        }
    }
    return output;
}

// নামের প্রথম অক্ষর দিয়ে ভাগ্য বিচার 
const luckFromFirstLettersDict = {
    'a': 'আপনি উচ্চাকাঙ্খার প্রতীক। আপনার মধ্যে থেকে ইচ্ছাশক্তি, উদারতা ও আদর্শবাদের প্রকাশ পাই। আপনার অগ্রগতি দৃঢ় পদক্ষেপ। আপনি সবর্দা মাথা উঁচু করে চলেন। আপনি অন্যায়ের বিরুদ্ধে মাথা উঁচু করে দাঁড়ান। জীবন যুদ্ধে আপনি জয়ী হয়ে থাকেন। আপনি সকলের কাছে জস ও সম্মান লাভ করে থাকেন।',
    'b': 'আপনি ভাবপ্রবণতার প্রতীক। আপনার মন খুব স্নেহপ্রবণ। আপনি মানব হিতার্থে কাজ করে থাকেন। আপনার মধ্যে প্রকৃত প্রেম হয়ে থাকে। আপনি সাহিত্য জগৎ কে ভালোবাসেন। দেশের পরাধীনতা কোনো মতে মানতে পারেন  না। আপনি প্রতিভাবান হয়ে থাকেন।',
    'c': 'আপনি সব বিষয়ে চূড়ান্ত সিদ্ধান্ত গ্রহণ করতে পারেন আপনার মধ্যে মানবিকতা আছে পাখি অন্যায় করেন না এবং সহ্য করেন না। আপনি বিজ্ঞান ও সাহিত্য চর্চার মধ্যে সাফল্য লাভ করে থাকেন। আপনি প্রতিটা বিষয়ে জানার আগ্রহ রাখেন। আপনার হৃদয় খুব কোমল। মানবের হিতার্থে আপনি সবকিছু ত্যাগ করে দিতে রাজি থাকেন। আপনি নিজের আদর্শের উপর দাঁড়িয়ে জীবনযাত্রা নির্বাহ করেন। ',
    'd': 'আপনি সর্বদা স্বয়ংসম্পূর্ণ হয়ে থাকেন। আপনি কখনো কারোর অপেক্ষায় থাকেন না সবসময় এগিয়ে থাকার চেষ্টা করেন। আপনার মধ্যে  আত্মকেন্দ্রিকতা থাকে। আপনি সবসময় আত্মসম্মান বজায় রাখার চেষ্টা করেন। সহসা কারো সাথে মিশতে ভালোবাসেন না। প্রবল স্বাধীন মনোভাব নিয়ে থাকেন খুব ঈশ্বরে বিশ্বাসী এবং আপনার মধ্যে বেশি গুন এর প্রভাব পাওয়া যায়।',
    'e': 'আপনি চিরবসন্তের প্রতীক। আপনি সর্বদা শ্যামলতা দ্বারা বেষ্টিত। আপনার প্রাণ সর্বদা চঞ্চল। উজ্জ্বল আলোর পথে এগিয়ে যাওয়ার জন্য আপনি সর্বদা সচেষ্ট। চলার পথে আপনি কখনো কোনো কারনে থমকে দাঁড়ান না। আপনার প্রবল কামনা বাসনা ও ভোগ্লিন্সা থাকে। আপনার সমকক্ষ কূটনীতিজ্ঞ মিলেনা। আপনার সহনশীলতা প্রবল। আপনার মধ্যে নানান বিষয় প্রতিভার বিকাশ দেখতে পাওয়া যায়।  আপনি কোন দেশের নামকরা ব্যক্তি ও হতে পারেন আপনার মধ্যে আত্মধিক চেতনাবোধ আছে।',
    'f': 'আপনার মানবিক চরিত্রের দৃঢ়তা বোধ আছে। আপনি জীবনে অনেক কষ্ট করে বড় মানুষ হয়ে থাকবেন। ভাই আপনার পরম ধর্ম ধর্ম। আপনি ভক্তিবাদী এবং সেবাপরায়ণ। আপনি বিরুদ্ধ পরিবেশে মানিয়ে চলতে পারেন। আপনি সহজেই ক্লান্ত হন না সাহিত্য রচনার থেকেও আপনার ঝোঁক  আছে আপনি একজন গণমান্য ব্যক্তি।',
    'g': 'চরিত্রের মধ্যে দৃরতা আছে। আপনার বুদ্ধি যেমন ঠিক তেমনি কষ্টসহিষ্ণু। আপনি ধর্ম মানলে ও কুসংস্কার মানতে রাজি হন না। ভবিষ্যতের ফলাফল চিন্তা না করে আপনি যেকোনো কাজেই এগিয়ে যান। জীবনে যে সমস্যা আসুক না কেন আপনি খুব সহজেই তা সমাধান করতে সক্ষম। আপনার মিতব্যায়িতা দেখে অনেকে কৃপণ মনে করতে পারে। সমাজ মূলক কাজে আত্মনিয়োগ করেন। নিজের আদর্শ বজায় রেখে আপনি সব কাজকর্ম করে থাকেন।',
    'h': 'অনেক দেরিতে আপনার প্রতিভার বিকাশ হয়ে থাকে। কোন সমস্যা বা দুঃখ বা কষ্টে আপনি বিচলিত হন না। অফিস সব অন্যায়ের প্রতিবাদ করে থাকেন। অনেক সময় আপনার মধ্যে অলসতা দেখা চাই এবং নিষ্ঠুর হয়ে পড়েন। জীবনের ঘাত-প্রতিঘাত স্বীকার করে নেয়ার মত ক্ষমতা আপনার থাকে।  আপনি প্রবল স্বজাতি প্রেমিক। আত্মসম্মান বজায় রেখে তবেই অপরের সাথে মেলামেশা করেন। নিজের ভুলের জন্য কোন ক্ষতি হলে তা স্বীকার করে নেন।',
    'i': 'আপনি হলেন সজীব জীবনের প্রতীক। আপনি জীবন সংগ্রামের একজন প্রকৃত যোদ্ধা হিসেবে পরিগণিত হন। আপনার প্রতিভা শক্তি প্রবল। আপনি সমাজের ও রাষ্ট্রের বন্ধু হিসেবে পরিচিত হন। অন্যের অন্যায় আচরণে আপনি বিদ্রোহ ঘোষণা করেন অপরের উপর প্রভুত্ব করেন কিন্তু নিজে কারো প্রভুত্ব স্বীকার করেন না। সর্বদা মাথা উঁচু করে চলতে ভালোবাসেন। শত্রু ও বিরোধী পক্ষ দমন করতে পারেনা। আপনি যেমন যদি তেমনি নতুন নতুন আবিষ্কার করতে সচেষ্ট থাকেন। আপনার পাণ্ডিত্য দেখে সবাই আশ্চর্য হয়ে যায়। যত দুঃখ কষ্ট আছে আপনি হাসিমুখে সহ্য করতে পারেন। আপনার নামে কেউ কলঙ্ক ছড়ালে তারই ক্ষতি হয়।',
    'j': 'আপনি চঞ্চলতা ও বুদ্ধিমান এর প্রতীক। আপনি প্রখর বুদ্ধিমান অপ্রিয় সত্য কথা বলতে আপনি কখনোই ভয় পান না। সমস্ত কথার উত্তর আপনি তীক্ষ্ম ভাষায় দিতে পারেন। কোনো বিষয়ে আবিষ্কার হিসেবে আপনি আলোড়ন তুলতে পারেন। আপনি উদার মনোভাবের মানুষ। সবার মধ্যে মিশে  থাকলেও আপনার মানবতার ও গুণের স্থান পৃথক। প্রমাণ ও আইন-শৃঙ্খলা মেনে আপনি বিচার করে থাকেন। সহজে কারোর কাছে আপনি আত্মসমর্পণ করতে চান না। আপনি ঈশ্বরকে মেনে চলেন বিজ্ঞান ও আধ্যাত্মিক সাধনায় চরম উন্নতি লাভ করতে পারেন। রাজনীতিতেও যশ ও খ্যাতি লাভ হতে পারে। আপনার সংগঠন শক্তি প্রবল আপনি যে কোন ব্যাপারে তাড়াতাড়ি সিদ্ধান্ত নিতে সক্ষম।',
    'k': 'আপনি একটু ভাবপ্রবণ এবং কল্পনাপ্রবণ হয়ে থাকেন। আপনার ইচ্ছাশক্তি প্রবল থাকায় আপনার যা ইচ্ছে আপনি সেই কাজ করতে আগ্রহী হন। ভাগ্যকে মেনে চলেন এবং সকল কাজে একাগ্রতা প্রকাশ করেন। সংগঠন শক্তি আপনার প্রবল বলেই সকলেই আপনার কথা সবাই মেনে চলে। সকলের কাছে আপনি সম্মান পেয়ে থাকেন।',
    'l': 'আপনার অনেক উপস্থিত বুদ্ধি থাকে তাই আপনি সকল বিষয়ে সূক্ষ্মাতিসূক্ষ্ম বিচার করে চলেন। পরাধীনতা আপনার সহ্য হয়না দেশমাতৃকার পরাধীনতার শৃংখল মোচন করতে আপনি প্রাণ পর্যন্ত দিতে পারেন। সংগঠন শক্তি প্রবল রাখতে আপনি সদা চেষ্টা করেন। আপনি আইন মেনে কাজ করেন এবং আপনার আধ্যাত্মিক চেতনা থাকলেও প্রত্যেক পদক্ষেপে ঈশ্বরের অস্তিত্ব স্বীকার করেন। নিচতাকে প্রশ্রয় দেন না। আপনি কবি সাহিত্যিক হতে পারেন আপনার নেতৃত্ব সার্থক হয়ে থাকে।',
    'm': 'আপনি কর্মময় জীবনের মূর্তপ্রতীক আপনার তারা অনেকেই উপকৃত হয় আপনি মানুষের দুঃখ কষ্ট জ্বালা যন্ত্রণা লাঘব করার জন্য চেষ্টা করেন। সমাজে আপনার খ্যাতি ও সম্মান থাকবে আপনার মধ্যে কোনো অহমিকা থাকে না। আপনি চির বিপ্লবী অন্যায় বিরুদ্ধে সর্বদা সজাগ থাকেন। কাজকর্মে সমাজের নেতৃত্বে গ্রহণ করা আপনার ইচ্ছার প্রতি নির্ভরশীল। সঙ্গী না থাকলেও আপনি একা একাই সমাজে সমাজের কাজে এগিয়ে যান। আপনি কারো সাহায্যের আশায় থাকেন না।',
    'n': 'আপনার প্রতি সকলের লক্ষ্য থাকে। কারণ আপনার কাছ থেকে সবাই কিছু আশা করে।  উত্থান-পতন আপনার মধ্যে থাকবে। জগৎজুড়ে আপনার খ্যাতি থেকে যাবে। আপনার মনে অহংকারও আছে। তাই হঠাৎ হঠাৎ সামান্য কথায় রেগে যাওয়া স্বভাব আছে তবে হঠাৎ রাগ হলেও তাড়াতাড়ি ঠান্ডা হয়ে যান।',
    'o': 'আপনি হঠাৎ কোন কাজে পিছিয়ে যান না সর্বদা আপনি চলার নীতি অনুসরণ করে থাকেন। পেছনের দিকে তাকাবার অবসর পান না। আপনি খুশি মত যে কোন কাজে হাত দিয়ে থাকেন। আপনি আইন-শৃঙ্খলার ধার ধারেন না। তার ফলে আপনাকে নিন্দা ও শোক সহ্য করতে হতে পারে। বিভিন্ন দিক থেকে আপনার প্রতিভার বিকাশ হয়ে থাকে। আপনি নিজের সম্বন্ধে সম্পূর্ণ সজাগ থাকেন।  আপনি ঈশ্বরে বিশ্বাস করেন তবে কুসংস্কার পছন্দ করেন না।',
    'p': 'আপনি কখনো নেতিবাচকের দিকে যান না। আপনি সবসময় সক্রিয় জগতকে অন্য দৃষ্টিতে দেখেন। আপনি অহেতুক কথা বলেননা। যুক্তিতর্ক ও বিচার করে কথা বলেন। আপনি সমাজের কাছে সামান্য কাজ করে সুনাম অর্জন করে থাকেন। রাজনীতিতে আপনার স্থান অনেক উচ্চ। আপনার প্রতিভাকে বিশেষভাবে কাজে লাগিয়ে খ্যাতি লাভ করে থাকেন। কোন বিষয়ে অনুশোচনা থাকেনা। সহসা আপনার পতোনের কথা কেউ বলতে পারেনা।',
    'q': 'আপনি একটা চরম সত্য লাভের জন্য সর্বদা ব্যাকুল থাকেন। চরম দুর্দশাতেও  আপনি কোনমতে বিচলিত হন না। আপনি সবসময় হাসি মুখে থাকেন। তবে অন্যায়ের প্রতি রুখে দাঁড়াতে ভুল করেন না।',
    'r': 'আপনি সকলকে যেন একটা নতুন মন্ত্র শেখাতে চান। আপনি একটা যুগান্তর আনার চেষ্টা করেন।  আপনার মধ্যে আছে এগিয়ে চলার মনোভাব।  পিছিয়ে পড়ার ইচ্ছা আপনার মনে থাকে না। সবার সাথে বন্ধুত্ব করতে খুবই আগ্রহ। কারণ আপনি মানবতা পূজারী হয়ে থাকেন তাই বিপদকালে আপনি অন্যদের সহায়ক হয়ে ওঠেন।',
    's': 'আপনি বিশেষ প্রতিভার অধিকারী হয়ে থাকেন। বেশি প্রতিবাদ থাকলেও পরিবেশ জনিত কারণে সব প্রতিভার বিকাশ ঘটে না। আপনি কঠোরভাবে ভাবে থাকতে ভাল মনে করেন। এবং এতে অন্য অনেকেই আপনার কাছে অনেক কিছু আশা করে থাকলেও আপনি তা দিতে পারেনা। সে কারণেই সকলের কাছে ঠিকমত সম্মান আপনি পাননা। আর্থিক সমস্যার উত্থান পতনের মাধ্যমে আপনার জীবন অতিবাহিত হয়। ',
    't': 'আপনি খুব জেদী এবং অহংকারী। সব কাজে আপনি নিজের আত্মসম্মান বজায় রেখে কাজ করেন। কোন কাজ আরম্ভ করলে শেষ না করে ছাড়তে পারেন না। তাই সব কাজের ভিত্তিতে আপনার মনোযোগ এবং একাগ্রতা প্রবল থাকে।  জীবনে বহু প্রকার উত্থান-পতনের মধ্য দিয়ে আপনি নির্বাহ করেন। তথাপি আপনি মানুষের কাছ থেকে অনেক শ্রদ্ধা ও সম্মান পেয়ে থাকেন।',
    'u': 'আপনি মেধাবী। এবং ভাগ্যের উপর নির্ভর করে চলেন। জীবনে আপনি সুযোগ-সুবিধা লাভ করে থাকেন। আপনার চারিত্রিক দিক জটিলতা পূর্ণ। আপনি ন্যায় অন্যায় বিচার করে প্রেমে লিপ্ত হন না। অ্যাপ্লি তীক্ষ্ণ বুদ্ধি দ্বারা সে কোন কাজে উত্তীর্ণ হয়ে থাকেন। আপনি দেশের নেতা রূপে পরিগণিত হতে পারেন। তাই এরা জনগণের কাছ থেকে শ্রদ্ধা ও ভালোবাসা পেয়ে থাকে।',
    'v': 'আপনি জীবন-যুদ্ধের অপরাজিত সৈনিক হয়ে থাকেন। অনেক ঘাত-প্রতিঘাত সহ্য করে আপনি জীবনে জয়ী হয়ে থাকেন। আপনি সবসময় মাথা উঁচু করে চলেন। কারো কাছে মাথা নিচু করেন না। ধর্ম-কর্ম মানতে আপনি ভালোবাসেন। আপনি আধ্যাত্মিক বিষয়ে বিশেষ আগ্রহী এবং সাধনায় সিদ্ধিলাভ করে থাকেন। ওদের জন্য আপনি মানব দরদী হয়ে থাকেন আপনি যেমন বেদান্তবাদী তেমন সমাজ সংস্কারক।',
    'w': 'আপনার মানসিক শক্তি প্রবল থাকায় মনে জোরে আপনি সব কাজ সম্পন্ন করতে পারেন। আপনার প্রতিভার বিকাশ চারদিকে প্রকাশিত হতে থাকে। আপনি বিভিন্ন দিক থেকে জীবনকে ভোগ বিলাসিতায় ভাসিয়ে দিতে চান। আপনার বহুগুণ থাকার জন্য মানুষ আপনাকে ভালোবাসে। মানুষের ভালোবাসা ও সম্মান পেয়ে আপনি সর্বদা মানসিক দিক থেকে আনন্দে থাকেন। মানুষকে আকর্ষণ করার শক্তি আপনার প্রবল থাকে। যে কোন মহিলাকে আপনি সহজে আকর্ষণ করতে পারেন। মহিলারাও পুরুষকে আকর্ষণ করতে অভ্যস্ত থাকে।',
    'x': 'আপনি জীবন বিভিন্ন সমস্যা ও ঝামেলার মধ্যে অতিবাহিত হয়। অনেক ক্ষেত্রে আপনি কাজকর্মেও অনেক অশান্তি অনেক ঝামেলা আসে। আপনি মানুষকে ভালোবাসেন কিন্তু ভালোবাসা পান না। আপনার মনে উদারতার ভাব থাকে অসীম। আপনি নিজের সত্তা বিসর্জন দিয়ে কোন কাজ করতে ভালোবাসেন না। আপনি যে মানুষের ভাল করে থাকেন, সেই মানুষরাই আপনার ক্ষতি করার চেষ্টা করে।',
    'y': 'সাধারণত ন্যায় নীতি মেনে চলা সহজাত স্বভাবের হন। আপনি স্নেহপ্রবণ দৃঢ়চেতা ও সত্যবাদী হয়ে থাকেন। সত্যের পথে চলা আপনি পছন্দ করেন। মিথ্যাবাদীকে এরা আপনি প্রশ্রয় দেন না। আপনি সবসময় একা একা থাকতে চান। কোনমতে কোলাহল বা  হৈচৈ করা পছন্দ করেন না। আপনার মনের ভাব খুব কঠিন তাই আপনার দর্শনে মনে হয় খুবই আত্মকেন্দ্রিক।',
    'z': 'সবসময় নিজেকে বড় করে তোলা ব্যাপারে সর্বদা চেষ্টা করেন। ধীরগতিতে আপনি সব কাজকর্ম করে থাকেন। আপনার চিন্তা শক্তি ও বুদ্ধি প্রখর। কোন কথা বলার আগে বেশ চিন্তাভাবনা করে তবে বলে থাকেন। আপনি জীবনে সাফল্য লাভ করে থাকবেন এবং সুনাম পাবেন। আপনার জীবনে কোনো সমস্যা এলে তা সুষ্ঠুভাবে সম্পন্ন করে থাকবেন। চতুরতা আপনার জীবনের বড় আদর্শ। চালাকির দ্বারা অবশ্য সর্বত্র করতে পারবেন না কোন প্রকার সেবামূলক কাজে আত্মনিয়োগ করতে পারবেন না মাঝে মাঝে সাহিত্য ও কবিতার দিকে অগ্রসর হতে পারে।'
};

// সৌভাগ্যের সাল 
// জন্মতারিখ ------> শুভ বছর 
const luckFromBirthDateList = [
    ['১','১০','১৯','২৮','৩৭','৪৬','৫৫','৬৪'], // 1
    ["২","১১","২০","২৯","৩৮","৪৭","৫৬","৬৫"],  // 2
    ["৩","১২","২১","৩০","৩৯","৪৮","৫৭","৬৬"],// 3
    ["৪","১৩","২২","৩১","৪০","৪৯","৫৮","৬৭"], // 4
    ["৫","১৪","২৩","৩২","৪১","৫০","৫৯","৬৮"], // 5
    ["৬","১৫","২৪","৩৩","৪২","৫১","৬০","৬৯"], // 6
    ["৭","১৬","২৫","৩৪","৪৩","৫২","৬১","৭০"], // 7
    ["৮","১৭","২৬","৩৫","৪৪","৫৩","৬২","৭১"], // 8
    ["৯","১৮","২৭","৩৬","৪৫","৫৪","৬৩","৭২"] // 0
];

// শ্রমসংখ্যা থেকে চাকুরী বা ব্যবসা 
const labourNumberToJobDict = {
    1:"সেনা, কারিগরি, দ্রুতবাস, রাজনীতি, সংগঠন, নেতৃত্ব, ধর্মকাজ, প্রচারক, ভ্রমণ, সম্পাদক, কারখানার পরিচালক, ম্যানেজার, রত্ন ও স্বর্ণকার, শিক্ষক, চলচিত্ত পরিচালক।",
    2:"ব্যাঙ্ক, বীমা এজেন্ট, হোটেল চালক, কেরানি, রাঁধুনি, স্টুয়ার্ড, আমদানি রপ্তানি ব্যবসা, ইঞ্জিনিয়ার, আইনবিদ, বিচারক, পোর্টার, নানা খাদ্য বিক্রেতা।",
    3:"শাসনযন্ত্রের কাজ, মন্দিরের কাজ, শিক্ষকতা, খেলোয়াড়, সিভিল সার্ভিস, আইনজ্ঞ, বিচারক, ইঞ্জিনিয়ার, ম্যাজিস্ট্রেট, রাজনীতিবিদ, দার্শনিক, দিনেমা বা থিয়েটার এ কাজ, প্রচারযন্ত্রে বিজ্ঞাপন বিভাগের কর্মী।",
    4:"ইমারত নির্মাতা, সিভিল ইঞ্জিনিয়ার, চাষী, কৃষিজীবী, কয়লা ব্যবসায়ী, সরকারি কাজ, চামড়া ব্যবসায়ী, খনিবিদ্যা বা ভূবিদ্যায় পারদর্শী।",
    5:"অভিনেতা, সাহিত্যিক, নাট্যকার, শিক্ষক, সম্পাদক, রাজনীতিজ্ঞ, সেলসম্যান, রেলকর্মী, প্রুফরিডার, প্রচারক, স্টেশনারি দ্রব্য বিক্রিতা, পুস্তক ব্যবসায়ী, দালাল, চিকিৎসক, নার্স।",
    6:"বিমান চালক, অভিনেতা, শিল্পী, শিক্ষক, চিকিৎসক, নির্মাতা কারখানা।",
    7:"পাইলট, বিচক্ষণ কর্মী, ফটোগ্রাফার, হস্তরেখাবিদ, পুস্তক ব্যবসায়ী।",
    8:"কারখানার মালিক ও কর্মী, দালাল, ব্যাঙ্ক, কর্মী, ক্যাশিয়ার, ইঞ্জিনিয়ার, ওষুধ বিক্রেতা, শিক্ষক, হোটেল কর্মী, বন্দর কর্মী, ফায়ারম্যান।",
    9:"পুলিশ, বিজ্ঞানী, অপরাধবিজ্ঞানী, বিধর্মী, ভ্রমণকারী, গুপ্তচর, চিত্রকর, মৎস্যব্যবসায়ী, শিল্পী।"
};

// রং দেখে ভাগ্যবিচার
const luckFromColorDict = {
    'black':'বিপদ এবং হতাশা যুক্ত মনোভাব নিঃসঙ্গ থাকতে ভালোবাসেন।',
    'chocolate':'শান্ত এবং রুচিসম্পন্ন সহসা উত্তেজিত হন। না বরং বলা যায় সংযত।',
    'violet':'সংরক্ষণশীল সেইসঙ্গে অত্যন্ত একগুঁয়ে। একগুঁয়েমি বা জেদ তার স্বভাব।',
    'red':'প্রফুল্ল হইচই প্রিয় জীবনের উজ্জ্বল দিক সম্পর্কে উত্সাহী কিন্তু মার্জিত রুচি সম্পন্ন নয়।',
    'orange':'আপনি হঠাৎ রেগে যান। কথাই কথাই বিরক্তি প্রকাশ করেন অনেক সময় ভাবপ্রবণ।',
    'yellow':'উজ্জ্বল দিন বেশি পছন্দ আপনার। আউটডোর গেমস এর প্রতি আগ্রহ গ্রামাঞ্চলে বেশি পছন্দ।',
    'green':'বৃদ্ধ হতে চান না বয়স লুকিয়ে বলতে আগ্রহী সাথে মেলামেশা করতে আগ্রহী। খুব জনচিত করতে ভালোবাসেন।',
    'blue':'গভীর চিন্তা করেন বিশেষ উদ্বেগ প্রকাশ করেন মেজাজ অস্থির কখনো প্রফুল্ল আবার কখনো বিষাদ এবং ভাবপ্রবণ।',
    'white':'পরিষ্কার মন। পবিত্র ও মার্জিত রুচি সম্পন্ন ভাব। মাঝে মাঝে বিনয়ের অবতার হয়।'
};

// Find lucky number from name
const luckyNumberFromNameDict = {
    'a':1,
    'b':2,
    'c':3,
    'd':4,
    'e':5,
    'f':6,
    'g':7,
    'h':8,
    'i':9,
    'j':1,
    'k':2,
    'l':3,
    'm':4,
    'n':5,
    'o':6,
    'p':7,
    'q':8,
    'r':9,
    's':1,
    't':2,
    'u':3,
    'v':4,
    'w':5,
    'x':6,
    'y':7,
    'z':8
}



const luckFromBirthMonth = (birthdate, birthMonth) => {
    // জন্মমাস অনুসারে ভাগ্য বিচার 
    const LuckFromBirthMonthDict = {
        'boishak': 'আপনি সরল উদার এবং প্রকৃতির হয়ে থাকেন। আপনি সহজে অন্যায় কাজ করতে পারেন না। সৎপথে ও নির্বিবাদে চলতে পছন্দ করেন। কোন প্রকার ঝামেলা পছন্দ করেন না। আপনার অর্থনৈতিক অবস্থা ভালো থাকে। আপনার কোন কাজ করার আগে আপনি ভালভাবে আগে চিন্তা করে নেন। আপনার বিবাহিত জীবন সুখপ্রদ নয়। তাই দুবার বিয়ে হতে পারে। আপনার 5 12 17 27 45 বছর বয়সে বিপদ থাকে। এগুলো অতিবাহিত হয়ে গেলে আপনার পরমায়ু 70 বছর পর্যন্ত অনিবার্য। জীবনে 2বার উন্নতির সুযোগ পাবেন। প্রথম 18 থেকে 25 বছর বয়সে। আর দ্বিতীয়বার 35 থেকে 40 বছর বয়স পর্যন্ত। আপনি সরল ও সৎ হতে থাকেন। এবং  উচ্চ বংশে জন্মগ্রহণ করেন। যদি আপনি স্ত্রী হন তাহলে স্বামী সুখ না ও হতে পারে। কিন্তু 30 বছর বয়সের পর থেকে দাম্পত্য প্রেমিক মহাসুখে অতিবাহিত হয়। আপনার সন্তান হয় গুণবান। শিল্প-সাহিত্য ও সৌন্দর্য প্রিয় হয়ে থাকে। কোন সময় অপরের দ্বারা প্রতারিত হতে পারেন। আপনার 3 7 30 বছর বয়সে বিপদ থাকে এগুলো অতিবাহিত হয়ে গেলে আপনার আপনি 90 বছর পর্যন্ত বাঁচতে পারেন।',

        'jhoisto': 'আপনি সৎ ও সভ্য প্রকৃতির মানুষ। আপনি জীবনে বহুবার উন্নতির সুযোগ পান। কোন বিশিষ্ট ব্যক্তির দ্বারা আপনার জীবনে উন্নতি হতে পারে। লটারি গুপ্তধন বাজে কোন আত্মীয়ের সম্পদ লাভ করতে আপনি সক্ষম। আপনি অপরের উপর প্রভাব বিস্তার করতে পারেন। তাই হয়তো আপনি অনেক নারীর প্রেমে জড়িয়ে পড়তে পারেন। আপনি ৩ ৮ বা ৩০ বছর বয়সে নানা বিপদের সম্মুখীন হবেন। তবে এসব অতিবাহিত হয়ে গেলে আপনি ৮০ বছর পর্যন্ত বেঁচে থাকতে পারবেন। 35 বছর বয়সে পরে আপনার জীবনে প্রতিষ্ঠা লাভ করবে। আপনি নাক কান ও গলার রোগে ভুগতে পারেন। আপনি সহজে কাউকে বিশ্বাস করেন না। আপনি রূপবতী। এবং বিবাহিত জীবন আপনার সুখের হয়।',

        'ashar': 'আপনি আমোদপ্রিয় এবং কৌতুক পূর্ণ হয়ে থাকেন। আপনি অপরকে হাসি খুশি করতে পারেন। সবাই আপনাকে খুব বিশ্বাস করে অপরের সাহায্যে আপনি জীবনে উন্নতি করতে পারবেন। আপনি প্রখর জ্ঞান ও বুদ্ধি সম্পন্ন হন। আপনার লোক দেখে এবং চিন্তা করে অপরের চরিত্র বুঝিয়ে বুঝতে সক্ষম হন। আপনার 16 21 50 বছর বয়সে বিপদের সম্ভাবনা। এই সময় অতিবাহিত হলে আপনি 70 বছর পর্যন্ত বেঁচে থাকতে পারবেন। আপনি খুব মিশুকে এবং কৌতুক প্রিয় হন। আপনি স্বাস্থ্যবতী ও সুন্দরী হয়ে থাকেন। আপনি যদি মহিলা হন তাহলে অনেক পুরুষ আপনার প্রতি আকৃষ্ট হয়। আপনি নিজের স্বামী ব্যতীত অন্য কারো দিকে মন দেন না।',

        'shrabon': 'আপনি আত্মকেন্দ্রিক হয়ে থাকেন। আপনি গম্ভীর হলেও অনেক মিশুক। আপনি অল্প বয়স থেকেই অর্থ উপার্জনের পথে অগ্রসর হোন।অপরের উপর ভরসা না করে নিজের পায়ে দাঁড়াতে চেষ্টা করেন। আপনার বিদেশ ভ্রমণের যোগ আছে। বিবাহিত জীবনে সুখ পাবেন। কিন্তু বদ লোকের পাল্লায় পড়লে বদনাম নিতে হবে। আপনার সাধারণত বুকের ও পেটের রোগ হয়ে থাকে। 12 18 30 বছর বয়সে বিপদ থাকে তা কেটে গেলে। ৭০ বছর পর্যন্ত আপনি বেঁচে থাকবেন। আপনার মিষ্টি চেহারার জন্য আপনি সকলের কাছে আদর পাবেন। আপনার মন নরম প্রকৃতির। তাই নানান কারণে নানা লোকের কাছ থেকে আপনাকে আঘাত সহ্য করতে হতে পারে। আপনি যদি মহিলা হয় আপনার স্বামী আপনাকে ভুল বুঝে কষ্ট পাবে। আপনার শত্রু থেকে আপনাকে সবসময় সচেতন থাকা উচিত। আপনি কোমর ও বুকের রোগে ভুগতে পারেন।',

        'vadro': 'আপনি তেজশ্রী ও পৌরসভার না হয়ে থাকেন নিজের প্রতি অনেকটা বিশ্বাস রাখেন আপনি অহংকারী হন তাই অন্যরা আপনাকে ভুল বুঝবে শত্রুপক্ষ ক্ষতি করার চেষ্টা করবে তবে চেষ্টা করেও তার ক্ষতি করতে পারবে না বিবাহিত জীবনে আপনি সুখ না পেতে পারেন। কষ্ট করে টাকা উপার্জন করতে হবে 7 22 এবং 28 বছরের বিপদ কেটে গেলে আপনি 75 বছর পর্যন্ত বেঁচে থাকবেন। আপনি যদি মহিলা হয়ে থাকেন তাহলে আপনি মনোমতো স্বামী লাভ করবেন। আপনি শ্বশুর শাশুড়ির কাছে অপ্রিয় হলেও স্বাধীনভাবে চলতে ভালোবাসেন। অপরের দান ও করুণা আপনার পছন্দ হয় না। আপনার ভাগ্য মোটামুটি ভালো তবে আপনার প্রায় নানান অসুখে ভুগতে থাকেন।',

        'ahswin': 'আপনি শান্ত আনন্দপ্রিয় এবং সৌভাগ্যের অধিকারী হয়ে থাকেন। আপনার ধর্ম হলেন সরলতা এবং অপরকে উপকার করা। স্বজনপ্রিয় ও ব্যায় বিলাসী হয়ে থাকেন। আপনার অনেক শত্রু থাকলেও তারা কেউ কোন ক্ষতি করতে পারে না। আপনার ভ্রমণের সুযোগ আছে। এবং তাতে লাভ হয়। 14 32 এবং 50 বছর বয়সে বিপদ থাকে। তবে এই সময় অতিবাহিত হলে আপনার আয়ুষ্কাল 65 বছর হয়ে থাকে। আপনি যদি মহিলা হন তাহলে আপনি সব সরল স্বাস্থবতী এবং মধুর ভাসিনি হয়ে ওঠেন। আপনি স্বামীর খুব প্রিয় হয়ে থাকেন। স্বামীর কথা বেদবাক্য মনে করে তা মেনে চলেন। আপনি শিশু প্রিয়, চতুর ও পরিশ্রমী হোন। অল্পতে রেগে গেলেও বোঝালে বুঝতে পারেন। আপনার প্রথম এবং শেষ জীবন সুখের হয়।',

        'kartik': 'আপনি খুব ধার্মিক এবং অনেক গুণের অধিকারী হয়ে থাকেন আপনার মন সরল প্রকৃতির এবং তীক্ষ্ণ বুদ্ধি সম্পন্ন হয়ে থাকে নানা দেশে ভ্রমণের সুযোগ আপনি পেতে পারেন তাতে কখনো লাভ এবং কখনো ক্ষতি হয়ে থাকে নিজের বুদ্ধি চেষ্টায় শ্রমের দ্বারা আপনি অর্থ উপার্জন করে থাকেন আপনি সমাজ জীবনে বহু বন্ধু-বান্ধব কারো কাছে কোন প্রকার প্রাপ্ত হতে পারে না মনের ভার্যা পেলে এরা এক নারীতে আসক্ত হয়ে পড়ে 6, 14, 21, 28 বছর বয়সে বিপদ থাকলেও সেই সময় অতিবাহিত হলে আপনি প্রায় 65 বছর পর্যন্ত জীবিত থাকে। আপনি মহিলা হলে আপনার জীবনে অনেক স্বপ্ন থাকলে ও কিছু কিছুই তা সফল হয়। আপনার বন্ধু অপেক্ষা শত্রু বেশি হয়। কথাই কথাই আপনি তর্ক করতে ভালবাসেন। তবে সেই তর্কের মধ্যে যুক্তি থাকে। সাধারণত আপনি পায়ের রোগে ভোগেন। তাই আপনার সাবধান থাকা দরকার।',

        'ograyan': 'আপনি খুব বন্ধুবৎসল হয়ে থাকেন। জীবনে অনেক বন্ধু-বান্ধব আপনি পান। বন্ধু বান্ধবের দ্বারা আপনি উন্নতি করে থাকেন। ভাগ্য আপনার মোটামুটি ভালো। জীবনে প্রচুর অর্থ উপার্জন করে থাকেন। দাম্পত্য জীবন থাকে নিরবিচ্ছিন্ন তাদের সুখ-দুঃখ থাকেনা আত্মীয়গণ আপনার সাথে প্রতারণা করতে পারে। শ্লেষ্মা জনিত রোগে ভুগতে থাকেন। সাধারণ জীবনযাপনে আপনার পছন্দ। আপনি পরিষ্কার-পরিচ্ছন্ন থাকতে ভালোবাসেন। কৃপণ হয়েও ঠিকমত না ভোগ করে অনেক পয়সার সঞ্চয় করেন। জীবনের 1 21 33 বছর বয়সে বিপদ সময় অতিবাহিত হলে আপনি 72 বছর পর্যন্ত জীবিত থাকেন। আপনি যদি মহিলা হন তাহলে আপনি সুন্দরী ও মিষ্টিভাষী হয়ে থাকেন। আপনার যে তীক্ষ্ণ বুদ্ধি আছে তা নিয়ে কারও সন্দেহ থাকে না। বহু পুরুষ আপনার প্রতি আকৃষ্ট হয় কিন্তু কোনো বিপদ হয় না। জীবনে আপনি প্রচুর ঐশ্বর্যের অধিকারী হয়ে থাকবেন। আপনার একটি সন্তান বিখ্যাত হবে। আপনার কথামতো স্বামী চললে লাভবান হবে। সাধারণত আপনি দাঁত ও পেটের রোগে ভোগেন।',

        'poush':'আপনি যদি পুরুষ হন, আপনি পরম ধার্মিক অথবা পরম ধর্ম বিরোধী। আপনি কাউকে বিশ্বাস করেন না আর বিশ্বাস করলেও প্রতারিত হন দাম্পত্য জীবন সুখের হয় বিয়ের পরে উন্নতি হয় আপনি দয়ালু ও মিষ্টভাষী অপরের সাথে ভুল বোঝাবুঝি হয়ে থাকে 9 22 40 বছর বয়সের বিপদ কেটে গেলে অতিবাহিত হলেই আপনি 72 বছর পর্যন্ত বাঁচতে পারবেন। আপনি যদি মহিলা হন তাহলে আপনি মোটামুটি সুন্দরী হয়ে থাকবেন। আপনার মুখশ্রী হবে সুন্দর এবং গোলগাল। রূপের জন্য আপনার থাকবে অভিমান। আপনি মানুষকে বিশ্বাস করেন। কিন্তু বিশ্বাস ভঙ্গ করলে আপনি রেগে যান। পরের কথায় আপনার স্বামী ভুল বুঝেন। আপনি অপর নারীদের ভালো চোখে দেখতে পারেন না। ফলে শত্রু বারে। আপনি সন্তান সুখে সুখী হন 2 5 10 36 বছর বয়সে ফাড়া আছে সেই সময় অতিবাহিত হলে আপনি 80 বছর পর্যন্ত বাঁচতে পারবেন।',

        'magh': 'আপনি খুব দয়ালু মায়াময় ও সততা। কোন কারন আপনার পরিণাম খুবই ভালো। ব্যবসা ও চাকরি তে আপনার উন্নতি হলেও ডাক্তারিতে প্রভুত আয় পেতে পারে। বন্ধু ভাগ্য আপনার ভালো। পিতা বা আত্মীয় সাহায্য পেলে জীবন সুখের হবে। ভ্রমণে আপনার লাভ ও সুখী হন। 30 বছর বয়সের পর আপনার উন্নতির পথ সৃষ্টি হয়। আপনার দাম্পত্য জীবন সুখের হয়। 4 21 37 বছর বয়সে আপনার ফাড়া কেটে গেলে 70 বছর পর্যন্ত আপনি বাঁচতে পারবেন। আপনি যদি মহিলা হন তাহলে আপনি আনন্দ এবং ঐশ্বর্য ভালবাসেন। মনে মনে কল্পনা প্রবণ ও অগণিত স্বপ্ন দেখলেও বাস্তবে তা পূরণ হয় না। পরিবারের সবার উদ্দেশ্য এর আকর্ষিত করতে ভালোবাসেন। এবং তাই হয়েও যায়। আপনি পেটের রোগে ভুগতে পারেন। আপনার বহু সন্তান হলেও একটি তারা সুখী হবেন।',

        'falgun': 'আপনি সঞ্চয়ী বুদ্ধিমান চিন্তাশীল হোন। আপনি যদি পুরুষ হন তাহলে আপনি কম কথা বলেন এবং মানব উপকার্থে বেশি চিন্তা করেন। আপনি সব কর্মে সফল হন। আপনি ভালো জনপ্রিয় ব্যবসায়ী হতে পারেন। স্বল্প ব্যয় হওয়ার জন্য আপনি প্রচুর অর্থ সঞ্চয় করতে পারবেন। অল্প বয়স থেকে উপার্জন করতে শুরু করেছিলেন বলে অর্থের অধিকারী হবেন। পিতা-মাতার প্রতি শ্রদ্ধা কৃতজ্ঞতা আপনার আছে। একাধিকবার বিবাহ করার ঝোঁক আপনার থাকতে পারে। প্রথম জীবনে নানান রোগে ভুগলে ও শেষ জীবনের স্বাস্থ্য ভালো থাকে ও শান্তিতে জীবন কাটাতে পারবেন। আর আপনি যদি মহিলা হন তাহলে আপনার জলে ডুবে যাওয়ার সম্ভাবনা বেশি। 9 30 42 বছর বয়সে ফাঁড়া থাকলে তা অতিবাহিত হলে আপনি 90 বছর পর্যন্ত বাঁচতে পারবেন। আপনি বহু সুখ ও সূর্যের অধিকারী হবেন। আপনার অনেক সম্পদ থাকবে। আপনি স্বাস্থ্যবতী স্বভাবের রানী হবেন। আপনার ক্রদ বেশি তাই অনেক শত্রু বেড়ে যায়। আপনি পটিপরায়ান হয়ে থাকেন। আপনি নিজের  পতি ছাড়া অন্য পুরুষকে সহ্য করতে পারেন না। 3 30 42 বছরের ফারা কেটে গেলে আপনি ৮০ বছর পর্যন্ত বাঁচতে পারবেন।',

        'choitya': 'আপনি ধার্মিক ও সাত্ত্বিক হয়ে থাকেন। আপনি যদি পুরুষ হন আপনি ধর্ম মত চললে জীবনে খুব উন্নতি করতে পারেন। আপনার মুখের ভাষা মিষ্ট। ব্যবহার খুব সুন্দর হয়। প্রথম জীবন কষ্টে অতিবাহিত হলেও 40 বছরের পর বিশেষ উন্নতি লাভ করবেন। চাকরীক্ষেত্রে অপেক্ষা বাবসাতে আপনার উন্নতি বেশি।  আপনার সংসারে আপনার আসক্তি কম থাকে। মনের মত স্ত্রী পেলে দাম্পত্য জীবনে সুখী হতে পারেন। সন্তান আপনার মনের সুখ শান্তি দিতে পারে। কিন্তু আপনি মানসিক দোটানায় ভুগতে থাকেন। বায়ু ও রক্তচাপ রোগে আপনি ভুগতে থাকেন। 15 18 22 51 বছরে আপনার ফারা কেটে গেলে প্রায় 95 বছর পর্যন্ত আপনি বাঁচতে পারবেন। আপনি যদি মহিলা হয়ে থাকেন আপনি খুব হাসিখুশি স্বভাবের হন। আপনি ধার্মিক ভাবাপন্ন বলে কিছু অন্যায় সহ্য করতে পারেন না। আত্মীয়-স্বজন সৎ না হলে তাদের সাথে সম্পর্ক রাখতে আপনি চান না। তাই অনেক  অজ্ঞানী লোক আপনার সম্বন্ধে ভুল বোঝে। পরিবারকে নিয়ে অনেক সুখে চিন্তাভাবনা আপনি করে থাকেন। পঁচিশ বছর বয়সের পর আপনার জীবনে সুখ আছে। 12 43 39 বছরএর ফারা কেটে গেলে আপনি ৭০ বয়স পর্যন্ত বাঁচতে পারবেন।'
    }
    let output = '';
    if(birthdate<=15){
        switch(birthMonth){
            case 1: output = LuckFromBirthMonthDict['poush'];
                    break;
            case 2: output = LuckFromBirthMonthDict['magh'];
                    break;
            case 3: output = LuckFromBirthMonthDict['falgun'];
                    break;
            case 4: output = LuckFromBirthMonthDict['choitya'];
                    break;
            case 5: output = LuckFromBirthMonthDict['boishak'];
                    break;
            case 6: output = LuckFromBirthMonthDict['jhoisto'];
                    break;
            case 7: output = LuckFromBirthMonthDict['ashar'];
                    break;
            case 8: output = LuckFromBirthMonthDict['shrabon'];
                    break;
            case 9: output = LuckFromBirthMonthDict['vadro'];
                    break;
            case 10: output = LuckFromBirthMonthDict['ahswin'];
                    break;
            case 11: output = LuckFromBirthMonthDict['kartik'];
                    break;
            case 12: output = LuckFromBirthMonthDict['ograyan'];
                    break;
        }
    }else{
        switch(birthMonth){
            
            case 1: output = LuckFromBirthMonthDict['magh'];
                    break;
            case 2: output = LuckFromBirthMonthDict['falgun'];
                    break;
            case 3: output = LuckFromBirthMonthDict['choitya'];
                    break;
            case 4: output = LuckFromBirthMonthDict['boishak'];
                    break;
            case 5: output = LuckFromBirthMonthDict['jhoisto'];
                    break;
            case 6: output = LuckFromBirthMonthDict['ashar'];
                    break;
            case 7: output = LuckFromBirthMonthDict['shrabon'];
                    break;
            case 8: output = LuckFromBirthMonthDict['vadro'];
                    break;
            case 9: output = LuckFromBirthMonthDict['ahswin'];
                    break;
            case 10: output = LuckFromBirthMonthDict['kartik'];
                    break;
            case 11: output = LuckFromBirthMonthDict['ograyan'];
                    break; 
            case 12: output = LuckFromBirthMonthDict['poush'];
                    break;
        }
    }
    return output;
}

// সংখ্যা অনুযায়ী চরিত্র গঠন 
const LuckFromLuckyNumberDict = {
        1:'আপনি সৎ উদার বুদ্ধিমান ও ধার্মিক হবেন। জীবনে উন্নতি করে যশ-খ্যাতি লাভ করবেন। নেতৃত্ব দেবার ক্ষমতা রাখেন। কিছুকাল ভালো লাগবে না শীতকালে মন বসবে। মিথ্যাচারিতা প্রশ্রয় দেবে না।',
        2:'স্বাস্থ্য সব সময় ভালো যাবে না। অত্যাধিক ভাবপ্রবণ আপনি। সহজেই সবাইকে বিশ্বাস করেন। নরম মনের মানুষ বলে সহজে যেকোন লোক আপনাকে ঠকাতে পারে। এবং তাতে আপনি দুঃখ পাবেন ।সহজেই সকলের ভালোবাসা পাবেন। সৎপ্রেমিক কিন্তু সরলতা হেতু প্রতিদান পায়না।',
        3:'আপনি সৎ ধার্মিক এবং ধৈর্যশীল সবার সাথে মিলেমিশে থাকতে ভালবাসেন বাকি জীবন সত্যের পথে ভালো হবে চলাফেরায় সাহায্য পাবেন জীবনে অনেক ব্যর্থতা সার্বিক উন্নতি দৃষ্ট হয়।',
        4:'আপনি খুব সাহসী। ও যদি হঠাৎ হঠাৎ কুসঙ্গে পড়ে যান। নিজেকে সাক্ষাত হলে অসাধ্য সাধনের সক্ষম।',
        5:'আপনি প্রতিভা সম্পন্ন বুদ্ধিমান। প্রেমে ও ব্যবসায় উন্নতির যোগ। যেকোনো কাজে আপনাকে ভরসা করা যায়।',
        6:'শিল্পী হতে পারে। সাজগোজ ভালোবাসেন। ভোগ করতে ইচ্ছা থাকলে দুঃখ পেতে হবে। সারাজীবন আনন্দেই কাটবে।',
        7:'আপনি নম্র ভদ্র এবং চাপা প্রকৃতির। বন্ধুভাগ্য ভালো থাকে। প্রেমে ফ্লপ কিন্তু একাধিক প্রেম হয়।',
        8:'আপনি ধার্মিক এবং পরোপকারী। তাই মানুষ অনেক সময় আপনাকে ভুল বুঝতে পারে।',
        9:'আপনি সাহসী যোদ্ধা। সাংসারিক জীবন সুখের হয় না। অসাধ্যসাধন করতে পারেন তবে অনেক ক্ষেত্রে মনের মিল হবে না।'
}